main_score = {
    "数分1": 94,  #
    "高等代数": 93, #
    "程设": 79,   #
    "大英1": 80,  #
    "思修": 85,   #
    "经管": 80,   #
    "走软": 94,   #
    "数分2": 85,  #
    "大物": 80,   #
    "电设": 94,   #
    "离散1": 96,  #
    "数据结构": 98, #
    "工图": 93,   #
    "大英2": 87,  #
    "史纲": 80,   #
    "习概": 88,   #
    "小学期1": 85, #
    "概统": 95,   #
    "基物": 80,   #
    "毛概": 90,   #
    "离散2": 87,  #
    "计算机组成": 90,    #
    "算法": 97,   #
    "跨文化": 83,  #
    "马原": 86,   #
    "军理": 85,   #
    "航概": 78,   #
    "数学建模": 98, #
    "信息检索": 87, #
    "操作系统": 92, #
    "数据库": 81,  #
    "面向对象": 92, #
    "软工1": 86,  #
    "职业规划": 92, #
    "小学期2": 97, #
    "智能计算机": 90, #
    "编译": 87,   #
    "系统编程": 90, #
    "计网": 95,   #
    "软工2": 85,  #
    "密码学": 93,  #
    "软工3": 91,  #
    "三创": 91,   #
    "并行计算": 99, #
    "人工智能": 92, #
    "科技写作": 87, #
    "分布式": 95,  #
    "物联网": 96,  #
    "图像处理": 96, #
    "企业文化": 90, #
    "小学期3": 97,

    "体育1": 75,  #
    "体育2": 83,  #
    "体育3": 66,  #
    "体育4": 89,  #
    "体育5": 78,  #
    "体育6": 80,  #
    "博雅1": 80,  #
    "博雅2": 90,  #
    "博雅3": 80,  #
    "博雅4": 90,  #
    "博雅5": 80,  #
    "博雅6": 90   #
}

not_main_score = {
    "启航学堂": 80,
    "离散3": 79,
    "嵌入式": 86,
    "网存": 83,
    "量子物理史话": 88,
    "博弈与社会": 88,
    "领导力": 91,
}

expected_score = {
}

all_weight = {
    "数分1": 6,
    "高等代数": 6,
    "程设": 2,
    "大英1": 4,
    "思修": 2,
    "经管": 2,
    "走软": 1.5,
    "量子物理史话": 2,
    "数分2": 6,
    "大物": 4,
    "电设": 2,
    "离散1": 2,
    "数据结构": 3,
    "工图": 1.5,
    "大英2": 4,
    "史纲": 3,
    "习概": 2,
    "博弈与社会": 2,
    "小学期1": 2,
    "概统": 3,
    "基物": 1,
    "毛概": 3,
    "离散2": 2,
    "计算机组成": 5,
    "算法": 3,
    "跨文化": 2,
    "马原": 3,
    "军理": 2,
    "航概": 2,
    "数学建模": 2,
    "信息检索": 1,
    "操作系统": 4.5,
    "数据库": 4,
    "面向对象": 3,
    "软工1": 4,
    "职业规划": 1,
    "小学期2": 2,
    "智能计算机": 2,
    "编译": 4.5,
    "系统编程": 2,
    "计网": 4,
    "分布式": 2,
    "人工智能": 2,
    "物联网": 2,
    "图像处理": 2,
    "并行计算": 2,
    "密码学": 2,
    "企业文化": 1,
    "软工2": 4,
    "软工3": 3,
    "三创": 1.5,
    "科技写作": 2,
    "小学期3": 2,


    "体育1": 0.5,
    "启航学堂": 0.5,
    "博雅1": 0.5,
    "体育2": 0.5,
    "博雅2": 0.5,
    "体育3": 0.5,
    "博雅3": 0.5,
    "体育4": 0.5,
    "博雅4": 0.5,
    "体育5": 0.5,
    "博雅5": 0.5,
    "体育6": 0.5,
    "博雅6": 0.5,
    "离散3": 3,
    "嵌入式": 2,
    "网存": 2,
    "领导力": 1,
}